In [1]:
1+1

2

In [2]:
from google.cloud import bigquery
import pandas

In [3]:
client = bigquery.Client(location="US")
print("Client creating using default project: {}".format(client.project))

query = """
    SELECT name, SUM(number) as total
    FROM `bigquery-public-data.usa_names.usa_1910_current`
    GROUP BY name
    ORDER BY total DESC
    LIMIT 10
"""

Client creating using default project: testinggcpbyveria

In [4]:

query_job = client.query(
    query,
    # Location must match that of the dataset(s) referenced in the query.
    location="US",
)  # API request - starts the query

df = query_job.to_dataframe()
df

      name    total
0    James  5029035
1     John  4894381
2   Robert  4754178
3  Michael  4377398
4  William  3914954
5     Mary  3753203
6    David  3615136
7  Richard  2546952
8   Joseph  2537788
9  Charles  2287121

In [5]:
query = """
    SELECT name, SUM(number) as total
    FROM `bigquery-public-data.usa_names.usa_1910_2013`
    GROUP BY name
    ORDER BY total DESC
    LIMIT 10
"""
query_job = client.query(
    query,
    # Location must match that of the dataset(s) referenced in the query.
    location="US",
)  # API request - starts the query

df = query_job.to_dataframe()
df

      name    total
0    James  4942431
1     John  4834422
2   Robert  4718787
3  Michael  4297230
4  William  3822209
5     Mary  3737679
6    David  3549801
7  Richard  2531924
8   Joseph  2472917
9  Charles  2244693